## Как использовать 4IFIR 

Все настройки осуществляются через Uberhand-меню, которое вызывается сочетанием клавиш `(L)+(R)+(▲)`, где `(L)` - верхний бампер левого джойкона, `(R)` - верхний бампер правого джойкона, а `(▲)` - кнопка вверх на "крестовине".

**Можете установить любую комбинацию в файле `/config/uberhand/config.ini`**

После одновременного нажатия этих трех кнопок появится Uberhand-меню со следующими пунктами: 

* **FPSLocker** - модуль для блокировки частоты кадров в играх
* **Fizeau** - модуль для управлением дисплея и его цветовыми профилями
* **InfoNX** - модуль, показывающий расширенную информацию о потреблении энергии консолью
* **QuickNTP** - модуль, позволяющий синхронизировать часы через интернет, поскольку встроенный метод синхронизации в кефире отключен 
* **ReverseNX-RT** - модуль, позволяющий принудительно выбрать режим работы консоли (портативный или докстаниця)
* **Status Monitor** - модуль, показывающий метрики работы системы в реальном времени поверх экрана, не отбирая управление у игры. Есть много режимов работы, в том числе режим, позволяющий вывести счетчики частот и FPS в левом верхнем углу экрана
* **EdiZone** - модуль для управления читами 
* **Sysmodules** - модуль, для управления модулями. Позволяет включать\отключать установленные модули
* **4IFIR Shaitan** - модуль для управления профилями разгона
* **SysDVR Overlay** - модуль, управляющий потоковой передачей изображения с консоли на ПК по WiFi или кабелю 

Нажав **(A)** на пункте, вы откроете его персональное меню.

### Включение и отключение модулей 

Модуль **Sysmodules** позволяет включать и выключать выбранные модули, а так же управлять их автозагрузкой. Имейте ввиду, что некоторые модули можно включать и выключать без перезагрузки, однако ряд модулей после включения требуют перезагрузки консоли. 

Справа от названия модуля указано его состояние, например **On | х**, где On говорит о текущем состоянии модуля (On - включен, Off - выключен), а **х** о том стоит ли модуль в автозагрузке (**х** - не стоит, **иконка домика** - стоит). 

Кнопкой **(A)** можно включить или выключить модуль. Кнопка (Y) включает или выключает автозагрузку модуля. Если при нажатии на кнопку (A) модуль не меняет своё состояние, значит им можно управлять только перезапуском консоли. Включите автозагрузку модуля и перезагрузите консоль, чтобы он начал работать, или выключите и перезагрузите, чтобы перестал. 

Модули, которые можно включать в любой момент сгруппированы сверху в группу **Dynamic**, а те, что требуют перезагрузки в группу **Static**.

### Управление режимом работы консоли (портатив \ докстанция, ReverseNX-RT)

Модуль **ReverseNX-RT** позволяет принудительно включать режим докстанции при игре в портативе и наоборот. С помощью кнопки **Change system control** нужно включить принудительное управление сменой режимов (отображается в строке **Controlled by system**, положение **No** означает, что можно менять режимы вручную). После чего можно переключать режимы кнопкой Change mode (отображается в строке **Mode**, где **Docked** - режим докстанции, **Handheld** - портатив).

Важно понимать, что в режиме докстанции консоль принудительно повышает частоты работы процессора, в следствии чего картинка становится более качественной, но и быстрее расходуется батарея.
