## Выжимаем больше - читы и патчи на улучшение графики 

#### Читы 

Помимо возможности включить режим докстанции при игре в портативе, можно дополнительно установить графические модификации для игр. Некоторые из них активируют большую частоту кадров, некоторые позволяют использовать производительность разогнанной консоли для улучшения отображаемой картинки, некоторые наоборот, улучшают производительность игры для стабильной работы на частотах без разгона. 

Читы для разблокировки 60FPS в некоторых играх можно взять в **AiO Updater** > **Download cheats** > **Download graphics enhancing cheats**. Если для установленных игр есть соответствующие читы, то они будут установлены автоматически. Помните что если для этих игр у вас уже были установлены читы, то установка читов для разблокировки удалит уже имеющиеся читы. Однако, если у вас есть читы для разблокировки FPS, то установка обычных читов через апдейтер просто добавит их, при этом сохранив читы на разблокировку. 

Активация читов проводится через меню **Underhand** > **EdiZon** > **Cheats** во включенной игре. В появившемся меню активируйте необходимый чит. После перезапуска игры, читы, что вы активировали ранее так же будут активны!

#### Модификации 

Моды для улучшения картинки нужно искать [на 4PDA](https://4pda.to/forum/index.php?act=findpost&pid=81825647&anchor=Spoil-81825647-8) или в телеграм-боте [Switch_library_bot](https://t.me/Switch_library_bot) по запросу `/mods` (пароль для бота - `kefir`).

Установка мода различается в зависимости от того как именно он сделан. 

* Если мод идет ввиду LayeredFS папки, то его нужно класть в `/atmosphere/contents/%TitleID%/romfs`, где TitleID - title id вашей игры, состоящий из 16 символов в 16-тиричной системе исчисления (например, 01002CC003FE6000). Отнеситесь внимательно к тому как именно такая модификация распространяется и не допустите вложенности папок. Например, если вы видите что в архиве с модом папка `atmosphere`, то просто распакуйте ее в корень карты памяти и согласитесь на замену файлов. Если в архиве лежит папка с title id игры, поместите ее в папку `/atmosphere/contents/`. Убедитесь, что папка не дублируется (например `/atmosphere/contents/01002CC003FE6000/romfs` - правильно, а `/atmosphere/contents/01002CC003FE6000/01002CC003FE6000/romfs` или `/atmosphere/atmosphere/contents/01002CC003FE6000/romfs` - не правильно), иначе мод не будет работать. 
* Если мод идёт в виде IPS-патча, то есть в виде файла или файлов с расширением `*.ips`, то поместите его в папку `atmosphere/exefs_patches`. В папке `atmosphere/exefs_patches` можете создать папку с названием мода, это допускается. Если в архиве с модом есть просто папка `exefs_patches`, то поместите её с заменой в папку `atmosphere`. Часто моды могут комбинировать оба способа, тогда нужно понять что именно и куда копировать. Если вам что-то не понятно, попробуйте поискать информацию там, где вы эти моды качали или в текстовом файле, который может распространяться вместо с модом. 

Модификации установленные таким образом автоматически активируются при запуске игры. 

Помните, что важна версия игры для которой делалась модификация. Мод, сделанный для одной версии игры может не заработать на другой. 

Не стесняйтесь играть с частотами и использовать Status Monitor для достижения наилучшего стабильного результата!

#### FPSLocker

С помощью этого плагина можно разлочить частоту кадров в некоторых играх без использования читов. 

Метрики в заголовке: 
* **Большое число справа** - показывает, сколько кадров прошло за последнюю секунду для запущенной игры. Позволяет убедиться, что программа работает верно
* **Interval Mode** - внутреннее значение игрового движка на базе NVN API, может принимать значение **0**, **1** или ****2****. Меняя это значение мы можем изменить максимальное количество FPS в игре. **2** - 30 FPS, **1** - 60 FPS, **0 - значить у игры нет ограничения на количество FPS, либо используется другое API. 
* **Custom FPS Target** - показывает максимальное количество FPS для данной игры. Если игра использует собственные ограничения FPS движка, а не стандартное, то может быть невозможно разблокировать более 30 FPS без дополнительных патчей

Переключатели:
* **Increase/Decrease FPS target** - изменить целевое количество кадров в секунду с шагом в 5 FPS. **Минимум** - 15 FPS, **максимум** - 60 FPS. Если FPS установлено более 30, то **Interval Mode** устанавливается на 1. В противном случае ставится 2.
* **Disable custom FPS target** - убирает ограничение FPS в зависимости от установленного **Interval Mode**. Если **Interval Mode** 2, то игра будет упираться в 30 FPS, если 1, то в 60. 
* **Sync Wait (!)** - это опасная настройка, которая в большинстве случаев будет приводить к падению игры (например, Witcher 3 и Breath of The Wild), но в некоторых случаях может принести пользу отключив двойную буферизацию, привнеся небольшие графические артефакты (например, Xenoblade Chronicles 3). Используйте с осторожностью. Рекомендуется держать **включенной**.
* **Save settings** - сохранить профиль для текущей запущенной игры, который будет автоматически загружен плагином при запуске в следующий раз. Не используйте эту функцию, если вы отключили синхронизацию (Sync Wait Off) и не проверили ее на безопасность, чтобы не пришлось вручную удалять сохраненный профиль. Профиль сохраняется в `SaltySD/plugins/FPSLocker/TITLEID.dat`
